# 0은 맨앞에올수없지만 맨뒤에는 올수있다.
# 뒤에 0이 올수있는 숫자는 1밖에 없음 즉 1개
# 9가 올수있는 숫자는 0을제외한 1~8 즉 8개
# 그외 2~8까지는 즉 d[i-1][j-1]+d[i-1][j+1]


# 1자리수일때->1,2,3,4,5,6,7,8,9=9개
# 2자리수일때->
# 0,1,2,3,4,5,6,7,8,9
#  / \..
# 0,1,2,3,4,5,6,7,8,9
# 10,12,21,23,32,34,43,45,54,56,65,67,76,78,87,89,98=17개
n=int(input())
d=[[0]* 10 for _ in range(n+1)]

# 일의 자리수는 0을 제외한 1로 초기화
for i in range(1,10):
    d[1][i]=1

for i in range(2,n+1):
    for j in range(10):
        if j==0:
            d[i][j]=d[i-1][j+1]
            # print("0일떄",d[i][j])
        elif j==9:
            d[i][j]=d[i-1][j-1]
            # print("9일떄",d[i][j])
        else:
            d[i][j]=d[i-1][j-1]+d[i-1][j+1]
            # print("나머지",d[i][j])
# print("d의 배열",d)
print(sum(d[n])%1000000000)
