#ATM ->N명
#[p1,p2,p3,p4,p5]  N=5
#p1=3 p2=1 p3=4 p4=3 p5=2
#3+(3+1)+(3+1+4)+(3+1+4+3)+(3+1+4+3+2)
#3+4+8+11+13=39

#p2->p5->p1->p4->p3
#1+(1+2)+(1+2+3)+(1+2+3+3)+(1+2+3+3+4)


#1+     ->p[0]
#3+     ->p[1]
#6+
#9+
#13=32



n=int(input())
Pn=list(map(int,input().split()))
Pn.sort() #정렬
sum=0


#p[0]+(p[0]+[1])+(p[0]+p[1]+p[2])+(p[0]+[1]+p[2]+p[3])+(p[0]+[1]+p[2]+p[3]+p[4])


#  p[i]+                                =sum+=p[i-4]
# (p[i]+p[i+1])+                        =sum+=p[i-3]
# (p[i]+[i+1]+p[i+2])+                  =sum+=p[i-2]
# (p[i]+p[i+1]+p[i+2]+p[i+3])+          =sum+=p[i-1]
# (p[i]+[i+1]+p[i+2]+p[i+3]+p[i+4])     =sum+=p[i]

# for i in range(0,5):#i=0,1,2,3,4
#     sum+=Pn[i]
# print(sum)  ----->13

for i in range(1,5):#i=1,2,3,4
    sum+=Pn[i]
print(sum)
